char_list_small_with_accents = [
    ['a', 'а', 'ａ', 'α', 'å', 'ã', 'ä', 'â', 'à'],
    ['b', 'Ь', 'ｂ', 'ʙ'],
    ['c', 'ϲ', 'с', 'ⅽ', 'ｃ'],
    ['d', 'ԁ', 'ⅾ', 'ｄ', 'ď', 'đ', 'ժ', 'ḍ'],
    ['e', 'е', 'ｅ', 'ė', 'é', 'ê', 'ë', 'ē', 'ĕ', 'ě'],
    ['f', 'ｆ'],
    ['g', 'ɡ', 'ｇ', 'ɢ'],
    ['h', 'һ', 'ｈ', 'ʜ'],
    ['i', 'і', 'Ꭵ', 'ⅰ', 'ｉ', 'ɩ'],
    ['j', 'ϳ', 'ј', 'ｊ'],
    ['k', 'κ', 'ｋ'],
    ['l', 'ⅼ', 'ｌ', 'I', 'Ι', 'І ', 'ᛁ', 'Ⅰ', 'Ｉ', 'ا', 'ι'],
    ['m', 'ⅿ', 'ｍ'],
    ['n', 'ɴ', 'ｎ'],
    ['o', 'ο', 'о', 'ｏ'],
    ['p', 'ρ', 'р', 'ｐ'],
    ['q', 'ｑ'],
    ['r', 'ʀ', 'ｒ'],
    ['s', 'ѕ', 'ｓ'],
    ['t', 'τ', 'ｔ'],
    ['u', 'υ', 'ｕ'],
    ['v', 'ν', 'ѵ', 'ⅴ', 'ｖ'],
    ['w', 'ѡ', 'ｗ'],
    ['x', 'х', 'ⅹ', 'ｘ', 'χ'],
    ['y', 'у', 'ỿ', 'ｙ', 'ʏ'],
    ['z', 'ｚ', 'ᴢ', 'ꮓ'],
]

char_list_small_without_accents = []

char_list_wide = [

    # LOWER CASE
    ["aɑаａ𝐚𝑎𝒂𝒶𝓪𝔞𝕒𝖆𝖺𝗮𝘢𝙖𝚊α𝛂𝛼𝜶𝝰𝞪⍺"],
    ["bƄЬᏏᑲᖯｂ𝐛𝑏𝒃𝒷𝓫𝔟𝕓𝖇𝖻𝗯𝘣𝙗𝚋"],
    ["cϲсᴄⅽⲥꮯｃ𐐽𝐜𝑐𝒄𝒸𝓬𝔠𝕔𝖈𝖼𝗰𝘤𝙘𝚌"],
    ["dԁᏧᑯⅆⅾꓒｄ𝐝𝑑𝒅𝒹𝓭𝔡𝕕𝖉𝖽𝗱𝘥𝙙𝚍"],
    ["eеҽ℮ℯⅇꬲｅ𝐞𝑒𝒆𝓮𝔢𝕖𝖊𝖾𝗲𝘦𝙚𝚎"],
    ["fſϝẝꞙꬵｆ𝐟𝑓𝒇𝒻𝓯𝔣𝕗𝖋𝖿𝗳𝘧𝙛𝚏𝟋"],
    ["gɡցᶃℊｇ𝐠𝑔𝒈𝓰𝔤𝕘𝖌𝗀𝗴𝘨𝙜𝚐"],
    ["hһհᏂℎｈ𝐡𝒉𝒽𝓱𝔥𝕙𝖍𝗁𝗵𝘩𝙝𝚑"],
    ["iıɩɪιіӏᎥℹⅈⅰ⍳ꙇꭵｉ"],
    ["jϳјⅉｊ𝐣𝑗𝒋𝒿𝓳𝔧𝕛𝖏𝗃𝗷𝘫𝙟𝚓"],
    ["kｋ𝐤𝑘𝒌𝓀𝓴𝔨𝕜𝖐𝗄𝗸𝘬𝙠𝚔"],
    ["mⅿｍ"],
    ["nոռｎ𝐧𝑛𝒏𝓃𝓷𝔫𝕟𝖓𝗇𝗻𝘯𝙣𝚗"],
    ["pρϱр⍴ⲣｐ𝐩𝑝𝒑𝓅𝓹𝔭𝕡𝖕𝗉𝗽𝘱𝙥𝚙𝛒𝛠𝜌𝜚𝝆𝝔𝞀𝞎𝞺𝟈"],
    ["pρϱр⍴ⲣｐ𝐩𝑝𝒑𝓅𝓹𝔭𝕡𝖕𝗉𝗽𝘱𝙥𝚙𝛒𝛠𝜌𝜚𝝆𝝔𝞀𝞎𝞺𝟈"],
    ["rгᴦⲅꭇꭈꮁｒ𝐫𝑟𝒓𝓇𝓻𝔯𝕣𝖗𝗋𝗿𝘳𝙧𝚛"],
    ["sƽѕꜱꮪｓ𐑈"],
    ["tｔ𝐭𝑡𝒕𝓉𝓽𝔱𝕥𝖙𝗍𝘁𝘵𝙩𝚝"],
    ["uʋυսᴜꞟꭎꭒｕ𐓶"]
    ["vνѵטᴠⅴ∨⋁ꮩｖ"],
    ["wɯѡԝաᴡ"],
    ["x×хⅹ⤫⤬⨯ｘ𝐱𝑥𝒙𝓍𝔁𝔵𝕩𝖝𝗑𝘅𝘹𝙭𝚡"],
    ["yɣʏγуүყᶌỿℽꭚｙ"],
    ["zᴢꮓｚ"],

    # UPPER CASE
    [],
    []

    # SPECIAL CHAR
]